# 인프런 약수빠르게 구하기 (#1978, #11653, #14232)
'''
Q. 숫자 N이 주어진다.
이 숫자의 약수가 총 몇 개가 포함되어 있는지 계산하고 싶다.
약수의 개수와, 약수들을 모두 출력하는 프로그램을 작성하시오.
'''



import sys
sys.stdin = open('input.txt')


# 원래 방식
# N = int(input())
#
# for i in range(1, n+1):
#     if N%i == 0:
#         print(i)

# 어떻게 빠르게 구현?
'''
16
1   16
2   8
4

18
1   18
2   9
3   6
이 있을 때 우리는 왼쪽 숫자만 구하고 그 값들을 숫자N에서 나눠주면 
자연스럽게 오른쪽 값이 도출된다. 
그럼 어떻게 왼쪽 값을 구할 수 있느냐 ? => N에 루트를 씌우고 int로 변환
루트=> N**0.5 

따라서
'''

N = int(input())

for i in range(1, int(N**0.5)+1):
    if N % i == 0:
        print(i, N//i)

